/*
Даний масив з числами, в ньому необхідно знайти і помістити в масив індекси двох чисел, 
сума яких дорівнюватиме заданому числу N. Якщо таких чисел немає, то повернути порожній масив.

Приклади коду:
   example([2, 7, 11, 15], 9) => [0, 1]
   example([12, 24, 34, 2], 14) => [0, 3]
   example([2, 7, 11, 15], 22) => [1, 3]
*/

function example(arr, n) {
  for (let i = 0; i < arr.length; i++) {
    if (arr[i] > n) continue; // якщо масив може містити елементи менше 0, цей рядок треба прибрати
    for (let j = 0; j < arr.length; j++) {
      if (arr[i] + arr[j] == n && i != j) return [i, j];
    }
  }
  return [];
}

console.log(example([2, 7, 9, 15], 9));
console.log(example([12, 24, 34, 2], 14));
console.log(example([2, 7, 11, 15], 22));
